In [1]:
import pandas as pd

In [21]:
# Dict 로 데이터프레임 생성
data = {
      '종목코드' : ['003730','036360','005760']
    , '종목명' : ['3R','3SOFT','ACTS']
    , '현재가' : [1510, 1790,1185]
}
data

{'종목코드': ['003730', '036360', '005760'],
 '종목명': ['3R', '3SOFT', 'ACTS'],
 '현재가': [1510, 1790, 1185]}

In [22]:
df = pd.DataFrame(data)
df

     종목코드    종목명   현재가
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [8]:
df.values

array([['003730', '3R', 1510],
       ['036360', '3SOFT', 1790],
       ['005760', 'ACTS', 1185]], dtype=object)

In [6]:
df.columns

Index(['종목코드', '종목명', '현재가'], dtype='object')

In [9]:
data = [
    ['003730', '3R', 1510],
    ['036360', '3SOFT', 1790],
    ['005760', 'ACTS', 1185]
]

In [10]:
df = pd.DataFrame(data)
df

        0      1     2
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [11]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [13]:
df.values

array([['003730', '3R', 1510],
       ['036360', '3SOFT', 1790],
       ['005760', 'ACTS', 1185]], dtype=object)

In [14]:
df

        0      1     2
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [15]:
df.columns = ['종목코드','종목명','현재가']
df

     종목코드    종목명   현재가
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [16]:
df.columns

Index(['종목코드', '종목명', '현재가'], dtype='object')

In [19]:
# set_index('컬럼명') : 특정 컬럼을 인덱스로 보낸다. 
df = df.set_index('종목코드') # 복제 진행, 원본
df

          종목명   현재가
종목코드
003730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [20]:
df['현재가']

종목코드
003730    1510
036360    1790
005760    1185
Name: 현재가, dtype: int64

In [23]:
df

     종목코드    종목명   현재가
0  003730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [24]:
# 종목코드	현재가
df[['종목코드','현재가']]

     종목코드   현재가
0  003730  1510
1  036360  1790
2  005760  1185

In [26]:
type(df['현재가']), type(df[['현재가']])

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [3]:
import pandas as pd
data = [
      ['3R',1510, 7.36]
    , ['3SOFT', 1790, 1.65]
    , ['ACTS', 1185, 1.28]
]
data

[['3R', 1510, 7.36], ['3SOFT', 1790, 1.65], ['ACTS', 1185, 1.28]]

In [4]:
index = ['037730','036360','005760']
columns = ['종목명','현재가','등락률']

df = pd.DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [31]:
df.iloc[-1] # 행번호 접근

종목명    ACTS
현재가    1185
등락률    1.28
Name: 005760, dtype: object

In [30]:
df.loc['037730'] # 명 인덱스로 접근

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [33]:
# 슬라이싱 : 연속
df.iloc[0:2]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [34]:
# 팬시 : 불연속 
df.iloc[[0,1]]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [37]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [38]:
df = df.loc[['037730','036360']]
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [41]:
df['종목명']

037730       3R
036360    3SOFT
Name: 종목명, dtype: object

In [44]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [45]:
df1 = df[['종목명','현재가']]
df1

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [47]:
df1.iloc[0]

종목명      3R
현재가    1510
Name: 037730, dtype: object

In [49]:
df2 = df.copy()
df2

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [54]:
df2.loc[['037730','036360'],['종목명','현재가']]

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790

In [56]:
df3 = df.copy()
df3

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [57]:
# 현재가 >= 1400
cond = df['현재가'] >= 1400
cond

037730     True
036360     True
005760    False
Name: 현재가, dtype: bool

In [58]:
df3.loc[cond]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [59]:
cond = (df3['현재가'] >= 1400) & (df3['현재가'] < 1700)
cond

037730     True
036360    False
005760    False
Name: 현재가, dtype: bool

In [62]:
df3.loc[cond]

       종목명   현재가   등락률
037730  3R  1510  7.36

In [70]:
df4 = df.copy()
df4

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [65]:
s = pd.Series(data=[1000,2000,3000], index=df4.index)
df4['목표가'] = s
df4

Index(['037730', '036360', '005760'], dtype='object')

In [68]:
df4

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [69]:
index = ['005760', '036361','037730']
s = pd.Series(data=[1000,2000,3000], index=index)
df4['목표가'] = s
df4

          종목명   현재가   등락률     목표가
037730     3R  1510  7.36  3000.0
036360  3SOFT  1790  1.65     NaN
005760   ACTS  1185  1.28  1000.0

In [72]:
df4['목표가'] = 1600
df4

          종목명   현재가   등락률   목표가
037730     3R  1510  7.36  1600
036360  3SOFT  1790  1.65  1600
005760   ACTS  1185  1.28  1600

In [73]:
df4['괴리율'] = (df4['목표가'] - df4['현재가']) / df4['현재가']
df4

          종목명   현재가   등락률   목표가       괴리율
037730     3R  1510  7.36  1600  0.059603
036360  3SOFT  1790  1.65  1600 -0.106145
005760   ACTS  1185  1.28  1600  0.350211

In [5]:
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [7]:
# 현재가 1500 큰 종목 행 조회
df1 = df.copy()
df1.loc[df1['현재가'] > 1500]

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [8]:
# 현재가 > 1500 행 삭제
df1.drop(df1.loc[df1['현재가'] > 1500].index, axis=0)

         종목명   현재가   등락률
005760  ACTS  1185  1.28

In [9]:
df1

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [10]:
df1.index.name = '종목코드'
df1

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [13]:
df1.rename(columns={
      '현재가' : 'close'
    , '종목명' : 'corpnm'
}, inplace=True) # 원본에 반영
df1

       corpnm  close   등락률
종목코드
037730     3R   1510  7.36
036360  3SOFT   1790  1.65
005760   ACTS   1185  1.28

In [14]:
df1[['등락률','corpnm','close']] # loc, iloc X => 컬럼 접근

         등락률 corpnm  close
종목코드
037730  7.36     3R   1510
036360  1.65  3SOFT   1790
005760  1.28   ACTS   1185

In [32]:
data = [
      ['1,000','1,100','1,510']
    , ['1,410','1,420','1,790']
    , ['850','900','1,185']
]
columns = ['03/02','03/03','03/04']
df = pd.DataFrame(data=data, columns=columns)
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   03/02   3 non-null      object
 1   03/03   3 non-null      object
 2   03/04   3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [18]:
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [30]:
def remove_comma_to_int(x): # map 적용할 때 x는 단일값
    return int(x.replace(',', ''))

In [27]:
# x.replace(',','')
text = '1,&1@85'
text.replace(',', '') \
         .replace('&', '') \
         .replace('@', '') 

import re # 정규표현식 처리 모듈
re.sub('(,|&|@)','',text)

'1185'

In [26]:
' 1,   234 '.replace(' ','')

'1234'

In [29]:
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [33]:
def remove_comma_to_int(x): # map 적용할 때 x는 단일값
    return int(x.replace(',', ''))

# df.map(remove_comma_to_int)
df1 = df.copy()

In [35]:
df1['03/02'] = df1['03/02'].map(remove_comma_to_int)
df1

   03/02  03/03  03/04
0   1000  1,100  1,510
1   1410  1,420  1,790
2    850    900  1,185